xmlFiles/bodyForRequestWithDbCall.xml

<s:Envelope
        xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body>
        <QueryTestPointStatistics
                xmlns="http://schemas.microsoft.com/TeamFoundation/2007/02/TCM/TestResults/01">
            <planId>102</planId>
            <query>
                <DayPrecision>true</DayPrecision>
                <QueryText>SELECT * FROM TestPoint WHERE SuiteId = 30147</QueryText>
                <TeamProjectName>projectName</TeamProjectName>
                <TimeZone>Belarus Standard Time;180;(UTC+03:00) Minsk;Belarus Standard Time;Belarus Daylight Time;[01:01:0001;12:31:2010;60;[0;02:00:00;3;5;0;];[0;03:00:00;10;5;0;];-60;][01:01:2011;12:31:2011;60;[0;02:00:00;3;5;0;];[0;00:00:00;1;1;6;];-60;];</TimeZone>
            </query>
        </QueryTestPointStatistics>
    </s:Body>
</s:Envelope>